<div style="display:block" direction=rtl align=right><br><br>
    <div  style="width:100%;margin:100;display:block"  display=block align=center>
        <img width=130 align=right src="https://i.ibb.co/yXKQmtZ/logo1.png" style="margin:200;" />
        <img width=170 align=left  src="https://i.ibb.co/wLjqFkw/logo2.png" style="margin:0;" />
        <span><br><font size=6>University of Tehran, school of ECE</font></span>
        <span><br><font size=4>Statistical Inference Course</font></span>
        <span><br><font size=3>R workshop</font></span>
        <span><br><font size=3>Missing Values, Data Frame</font></span>
        <span><br><font size=3>Spring 1402</font></span>
    </div><br><br><br>
    <div style="display:block" align=left display=block> 
    </div>
    <hr />
</div>

- [x] basic data type
- [x] vectors
- [x] factors
- [x] lists
- [ ] missing values in R
- [ ] dataframe

# Missing Values 

R has two types of missing data, `NA` and `NULL`. While they are similar, they behave differently and that difference needs attention.

## NA (Not Available)

Often we will have data that has missing values for any number of reasons.`NA` will be seen as just another element of a vector.

In [ ]:
grades <- c(14, 19, 18, NA, 17, 20, 16, 18, 16, NA)
print(grades)

`is.na` tests each element of a vector for missingness.

In [ ]:
is.na(grades)

If we calculate the mean of grades, the answer will be `NA` since mean returns `NA` if even a
single element is `NA`.

In [ ]:
print(mean(grades))

   When the `na.rm` is `TRUE`, mean first **removes the missing data**, then calculates the mean.

In [ ]:
print(mean(grades, na.rm = TRUE))
print(var(grades, na.rm = TRUE))

## NULL

* `NULL` is the absence of anything. 
* `NULL` is not exactly **missingness**, it is **nothingness**. 
* An important difference between `NA` and `NULL` is that `NULL` cannot exist within a vector. If used inside a vector, it simply disappears.

In [ ]:
grades <- c(14, 19, 18, NULL, 17, 20, 16, 18, 16, NULL)
print(grades) #?

In [ ]:
print(mean(grades))

# Data Frames

* A `data.frame` is just like an Excel spreadsheet in that it has columns and rows.
* In statistical terms, each column is a variable and each row is an observation.
* Each column is actually a vector.
* Columns must be same length.

## Construct a Dataframe using `data.frame()` function

In [1]:
h <- c(171, 177, 168, 180, 172, 183, 186, 170, 175)
w <- c(70, 80, 65, 84, 64, 90, 95, 73, 75)
s <- c("SOCCER","VOLLEY", "TENNIS", "VOLLEY", "TENNIS",  "VOLLEY", "VOLLEY", "SOCCER", "TENNIS")
df <- data.frame(h,w,s)
df

  h   w  s
1 171 70 SOCCER
2 177 80 VOLLEY
3 168 65 TENNIS
4 180 84 VOLLEY
5 172 64 TENNIS
6 183 90 VOLLEY
7 186 95 VOLLEY
8 170 73 SOCCER
9 175 75 TENNIS

 We could have assigned names during the creation process:

In [2]:
df <- data.frame(height=h, weight=w, sport=s)
df

  height weight sport
1 171    70     SOCCER
2 177    80     VOLLEY
3 168    65     TENNIS
4 180    84     VOLLEY
5 172    64     TENNIS
6 183    90     VOLLEY
7 186    95     VOLLEY
8 170    73     SOCCER
9 175    75     TENNIS

## Calling Functions

In [3]:
nrow(df)

[1] 9

In [4]:
ncol(df)

[1] 3

In [5]:
print(dim(df))

[1] 9 3

Checking the column names of a `data.frame` is as simple as using the `names()` function. This returns a character vector listing the columns.

In [6]:
print(names(df))

[1] "height" "weight" "sport"

`head()` function prints out only the first few rows.

In [7]:
head(df, n=3)

  height weight sport
1 171    70     SOCCER
2 177    80     VOLLEY
3 168    65     TENNIS

## Access to data.frame elements

Similar to **Lists**, data.frames allow us to access individual elements by their
position using brackets. first is the row number and the second is the column number. So to get the third row from
the second column we use `df[3, 2]`.

In [11]:
df[3,2]

[1] 65

To specify more than one row or column, use a `vector` of indices:

In [12]:
# rows 3 through 5, columns 1 and 3
df[3:5,c(1,3)]

  height sport
3 168    TENNIS
4 180    VOLLEY
5 172    TENNIS

To access an entire row, specify that row while not specifying any column. Likewise, to access an entire column, specify that column while not specifying any row.

In [13]:
# all of columns 2 through 3
df[,2:3]

  weight sport
1 70     SOCCER
2 80     VOLLEY
3 65     TENNIS
4 84     VOLLEY
5 64     TENNIS
6 90     VOLLEY
7 95     VOLLEY
8 73     SOCCER
9 75     TENNIS

In [14]:
# all of rows 2 through 4
df[2:4,]

  height weight sport
2 177    80     VOLLEY
3 168    65     TENNIS
4 180    84     VOLLEY

To access multiple columns by name, make the column argument a character vector of the names

In [15]:
df[,c("weight", "sport")]

  weight sport
1 70     SOCCER
2 80     VOLLEY
3 65     TENNIS
4 84     VOLLEY
5 64     TENNIS
6 90     VOLLEY
7 95     VOLLEY
8 73     SOCCER
9 75     TENNIS

### Remember From Lists

In [16]:
df['weight']

  weight
1 70
2 80
3 65
4 84
5 64
6 90
7 95
8 73
9 75

In [17]:
class(df['weight'])

[1] "data.frame"

In [18]:
df[['weight']]

[1] 70 80 65 84 64 90 95 73 75

In [19]:
class(df[['weight']])

[1] "numeric"

In [20]:
df$weight

[1] 70 80 65 84 64 90 95 73 75

R `data.frame()` function automatically converts columns (vectors) of characters to factors.

In [21]:
df$sport

[1] SOCCER VOLLEY TENNIS VOLLEY TENNIS VOLLEY VOLLEY SOCCER TENNIS
Levels: SOCCER TENNIS VOLLEY

In [22]:
df$sport == "TENNIS"

[1] FALSE FALSE  TRUE FALSE  TRUE FALSE FALSE FALSE  TRUE

In [23]:
mask <-c(FALSE, FALSE, TRUE, FALSE, TRUE, FALSE, FALSE, FALSE, TRUE)
df$sport[mask]

[1] TENNIS TENNIS TENNIS
Levels: SOCCER TENNIS VOLLEY

In [24]:
df[df$sport == "TENNIS",]

  height weight sport
3 168    65     TENNIS
5 172    64     TENNIS
9 175    75     TENNIS

In [25]:
df[df$sport == "TENNIS",c("weight", "height")]

  weight height
3 65     168
5 64     172
9 75     175